app/views/questions/_question_fields.html.erb

    <%#= f.number_field :metric_id %>
      <%= f.collection_select :metric_id, Metric.all, :id, :metric_name, {prompt: "Select a Metric"}%>
---
SELECT `metrics`.* FROM `metrics`