app/views/static/_admin_template_list.html.erb

SELECT COUNT(*) FROM `questions` INNER JOIN `campaigns_questions` ON `questions`.`id` = `campaigns_questions`.`question_id` WHERE `campaigns_questions`.`campaign_id` = 1
SELECT COUNT(*) FROM `campaigns`  WHERE `campaigns`.`template_id` = 1
SELECT COUNT(*) FROM `campaigns`  WHERE `campaigns`.`template_id` = 1 AND `campaigns`.`status` = 'Draft'
---
	  	<td><%= campaign.name %></td>
	  	<td><%= campaign.questions.count %></td>
	  	<td><%= Campaign.where(template_id: campaign.id).count %></td>
	  	<td><%= Campaign.where(template_id: campaign.id, status: "Draft").count %></td>