app/views/static/_campaign_list.html.erb

	  <% if campaign.status != "Complete" %>
	  	<td><%= best_in_place campaign, :vendor_id, :as => :select, :collection => Vendor.all.map { |i| [i.id, i.name] }, :placeholder => "Not Set" %></td>
---
SELECT `vendors`.* FROM `vendors`   ORDER BY tier DESC, cw DESC

		  	<% if (campaign.end_date < Date.today && campaign.status != "On Hold")%>
		  		<% campaign.update(status: "Complete") %>
---
UPDATE `campaigns` SET `end_date` = NULL, `start_date` = '2020-12-01', `updated_at` = '2020-01-13 19:36:37' WHERE `campaigns`.`id` = 41

		<% end %>
		 <% progress_percent = ((campaign.reviewers.where(survey_complete:true).count.to_f/(campaign.reviewers.count.to_f))*100.0).round(2)%>
---
SELECT COUNT(*) FROM `reviewers` INNER JOIN `campaigns_reviewers` ON `reviewers`.`id` = `campaigns_reviewers`.`reviewer_id` WHERE `campaigns_reviewers`.`campaign_id` = 36 AND `reviewers`.`survey_complete` = 1

		  		<% if campaign.specialist_id.present? %>
		  			<%= User.find(campaign.specialist_id).name %>
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1

		  	</td>
		<td> <%= campaign.created_at %> </td>
---
INSERT INTO `campaigns` (`created_at`, `customer_id`, `end_date`, `executive_sponsor`, `manager_id`, `name`, `ready`, `specialist_id`, `start_date`, `status`, `survey_sent`, `template`, `template_id`, `tier`, `updated_at`, `vendor_id`) VALUES ('2019-12-26 20:51:16', 3, '2019-12-31', 'Haynes', 3, 'Bergrun', 0, 14, '2019-12-01', 'Draft', 0, 0, 17, 1, '2019-12-26 20:51:16', 5)