app/views/static/_customer_admin_list.html.erb

		  	<td><%= best_in_place customer, :size %></td>
		  	<td><% customer.ctypes.each do |c| %>
---
SELECT `ctypes`.* FROM `ctypes` INNER JOIN `cassociations` ON `ctypes`.`id` = `cassociations`.`ctype_id` WHERE `cassociations`.`customer_id` = 2