app/views/static/_results.html.erb

SELECT COUNT(*) FROM `graphs`
---
<script>
		$("#powerpoint").click(function(){
			graph_count = <%= Graph.all.count %>
			$(".slide-rows").empty();
			$(".slide-rows").html("<h3 style='text-align:center;'>Your Powerpoint has been created and will be emailed to you shortly.</h3>");
		});