app/views/static/_specialist_campaign_list.html.erb

SELECT `vendors`.* FROM `vendors`
---
	  	<% if campaign.status != "Complete" %>
	  	<td><%= best_in_place campaign, :vendor_id, :as => :select, :collection => Vendor.all.map { |i| [i.id, i.name] }, :placeholder => "Not Set" %></td>

UPDATE `campaigns` SET `status` = 'Complete', `updated_at` = '2020-01-13 18:27:27' WHERE `campaigns`.`id` = 37
---
		  	<% if (campaign.end_date < Date.today && campaign.status != "On Hold")%>
		  		<% campaign.update(status: "Complete") %>

SELECT COUNT(*) FROM `reviewers` INNER JOIN `campaigns_reviewers` ON `reviewers`.`id` = `campaigns_reviewers`.`reviewer_id` WHERE `campaigns_reviewers`.`campaign_id` = 37 AND `reviewers`.`survey_complete` = 1
---
		<% end %>
		 <% progress_percent = ((campaign.reviewers.where(survey_complete:true).count.to_f/(campaign.reviewers.count.to_f))*100.0).round(2)%>