app/views/static/_survey_progress.html.erb

<% if @campaign.reviewers.present? %>
---
SELECT `reviewers`.* FROM `reviewers` INNER JOIN `campaigns_reviewers` ON `reviewers`.`id` = `campaigns_reviewers`.`reviewer_id` WHERE `campaigns_reviewers`.`campaign_id` = 36