app/views/vendors/_new.html.erb

SELECT `roles`.* FROM `roles` INNER JOIN `user_roles` ON `roles`.`id` = `user_roles`.`role_id` WHERE `user_roles`.`user_id` = 1
---
	  </div>
	  <% if current_user.roles.first.id == 1%>