app/controllers/campaigns_controller.rb

  def new
    @campaign = Campaign.new
    @metric = Metric.new
    @metrics = Metric.all
    2.times { @campaign.questions.build }
    @templates = Campaign.where(template:true)
---
SELECT `metrics`.* FROM `metrics`
SELECT `campaigns`.* FROM `campaigns`  WHERE `campaigns`.`template` = 1

  def add_reviewers
    @campaign = Campaign.find(params[:id])
    @vendor = Vendor.find(@campaign.vendor_id)
    logger.debug "Campaign Reviewers: #{@campaign.reviewers.blank?}"
---
SELECT  `campaigns`.* FROM `campaigns`  WHERE `campaigns`.`id` = 37 LIMIT 1
SELECT  `vendors`.* FROM `vendors`  WHERE `vendors`.`id` = 12 LIMIT 1
SELECT `reviewers`.* FROM `reviewers` INNER JOIN `campaigns_reviewers` ON `reviewers`.`id` = `campaigns_reviewers`.`reviewer_id` WHERE `campaigns_reviewers`.`campaign_id` = 37

  def survey
    @reviewer = Reviewer.find_by_token(params[:token])
    logger.debug "@reviewer is : #{params[:token]}"
    #campaign_id = CampaignsReviewer.find_by_reviewer_id(@reviewer.id).campaign_id
    cmp = Campaign.find_by_sql("SELECT campaigns.id, campaigns_reviewers.reviewer_id FROM campaigns, campaigns_reviewers
                                   WHERE campaigns.id = campaigns_reviewers.campaign_id AND campaigns_reviewers.reviewer_id = #{@reviewer.id}")
    logger.debug "cmp.inspect is : #{cmp[0].id}"
    @campaign = Campaign.find(cmp[0].id)
=begin
    incomplete = 0
    @campaign.questions.each do |q|

      if (q.responses.where(reviewer_id: @reviewer.id).blank?) || (q.responses.where(reviewer_id: @reviewer.id, answer_option: nil).present?)
---
SELECT  `reviewers`.* FROM `reviewers`  WHERE `reviewers`.`token` = '0DEF7B59F5' LIMIT 1
SELECT  `campaigns`.* FROM `campaigns`  WHERE `campaigns`.`id` = 28 LIMIT 1
SELECT `questions`.* FROM `questions` INNER JOIN `campaigns_questions` ON `questions`.`id` = `campaigns_questions`.`question_id` WHERE `campaigns_questions`.`campaign_id` = 28
SELECT `responses`.* FROM `responses`  WHERE `responses`.`reviewer_id` = 10

  def edit
    @metrics = Metric.all
    @questions = @campaign.questions
    @templates = Campaign.where(template:true)
---
SELECT `metrics`.* FROM `metrics`
SELECT `campaigns`.* FROM `campaigns`  WHERE `campaigns`.`template` = 1

  def create
    @campaign = Campaign.new(campaign_params)
    @campaigns = Campaign.where(manager_id: current_user.id, template: false).order(created_at: :desc)
    @campaign.manager_id = current_user.id
    @campaign.status = "Draft"
    @campaign.survey_sent = false
    @templates = Campaign.where(template:true)
    @campaign.customer_id = current_user.customer_id
    @campaign.ready = false
    @vendor_array = []
      Vendor.all.each do |v|
        if v.customers.where(id: @campaign.customer_id).present?
          @vendor_array.push(v)
        end
      end
      @specialist_array = []
      User.where(customer_id: current_user.customer_id).each do |u|
        logger.debug "---------------------USER ROLE: #{u.roles.first}----------------------------"
        if u.roles.first.id == 3
          @specialist_array.push(u)
        end
      end

    if current_user.roles.first.id == 1
      @campaign.template = true
    else
      @campaign.template = false
    end
    respond_to do |format|
      if @campaign.save
---
SELECT `campaigns`.* FROM `campaigns`  WHERE `campaigns`.`manager_id` = 1 AND `campaigns`.`template` = 0  ORDER BY `campaigns`.`created_at` DESC
SELECT `vendors`.* FROM `vendors`
SELECT `campaigns`.* FROM `campaigns`  WHERE (customer_id = 3 and vendor_id = 12 and status != 'Complete' and specialist_id IS NOT NULL)
SELECT `users`.* FROM `users`  WHERE `users`.`customer_id` = 1
SELECT  `roles`.* FROM `roles` INNER JOIN `user_roles` ON `roles`.`id` = `user_roles`.`role_id` WHERE `user_roles`.`user_id` = 1  ORDER BY `roles`.`id` ASC LIMIT 1
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `campaigns` (`created_at`, `customer_id`, `end_date`, `executive_sponsor`, `manager_id`, `name`, `ready`, `specialist_id`, `start_date`, `status`, `survey_sent`, `template`, `template_id`, `tier`, `updated_at`, `vendor_id`) VALUES ('2019-12-26 20:51:16', 3, '2019-12-31', 'Haynes', 3, 'Bergrun', 0, 14, '2019-12-01', 'Draft', 0, 0, 17, 1, '2019-12-26 20:51:16', 5)

  def update
    if current_user
      @campaigns = Campaign.where(manager_id: current_user.id, template: false).order(created_at: :desc)
      @specialist_campaigns = Campaign.where(specialist_id: current_user.id, template: false, ready: true).order(created_at: :desc)
      @templates = Campaign.where(template:true)
      @customer = Customer.find(current_user.customer_id) if !current_user.customer_id.blank?
      @current_user_role = current_user.roles.first.id
      @vendor_array = []
          Vendor.all.order('tier DESC, cw DESC').each do |v|
            if v.customers.where(id: @customer.id).present?
              @vendor_array.push(v)
            end
          end
      @specialist_array = []
      User.where(customer_id: @customer.id).each do |u|
        logger.debug "---------------------USER ROLE: #{u.roles.first}----------------------------"
        if u.roles.first.id == 3
          @specialist_array.push(u)
        end
      end
      @id_array = []
    @cw_total = 0
    @cw_average = 0
    @this_specialist = []
    @this_vendor = []
    @vendor_array.each do |v|
      @id_array.push(v.id)
    end
    Campaign.where(customer_id: current_user.customer_id, vendor_id: @id_array, end_date: "#{Time.now.year}0101".."#{Time.now.year}1231").each do |c|
---
SELECT `campaigns`.* FROM `campaigns`  WHERE `campaigns`.`manager_id` = 3 AND `campaigns`.`template` = 0  ORDER BY `campaigns`.`created_at` DESC
SELECT  `customers`.* FROM `customers`  WHERE `customers`.`id` = 3 LIMIT 1
SELECT `campaigns`.* FROM `campaigns`  WHERE (customer_id = 3 and vendor_id = 12 and status != 'Complete' and specialist_id IS NOT NULL)
SELECT  `campaigns`.* FROM `campaigns`   ORDER BY `campaigns`.`id` DESC LIMIT 1
SELECT  `roles`.* FROM `roles` INNER JOIN `user_roles` ON `roles`.`id` = `user_roles`.`role_id` WHERE `user_roles`.`user_id` = 3  ORDER BY `roles`.`id` ASC LIMIT 1
SELECT `vendors`.* FROM `vendors`   ORDER BY tier DESC, cw DESC
SELECT `users`.* FROM `users`  WHERE `users`.`customer_id` = 3
SELECT `campaigns`.* FROM `campaigns`  WHERE `campaigns`.`customer_id` = 3 AND `campaigns`.`vendor_id` IN (12) AND (`campaigns`.`end_date` BETWEEN '20190101' AND '20191231')
SELECT `customers`.* FROM `customers` INNER JOIN `customers_vendors` ON `customers`.`id` = `customers_vendors`.`customer_id` WHERE `customers_vendors`.`vendor_id` = 5 AND `customers`.`id` = 3

     unless any_vendors > 0
       @this_vendor << c.vendor_id
     end
     if Vendor.find(c.vendor_id).cw
---
SELECT  `vendors`.* FROM `vendors`  WHERE `vendors`.`id` = 12 LIMIT 1

      end
      unless any > 0
       if c.specialist_id.present?
        @this_specialist << User.find(c.specialist_id)
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 3  ORDER BY `users`.`id` ASC LIMIT 1

      @cw_average = "N/A"
      @this_vendor_per_specialist = "N/A"
    end
    @this_year_campaigns = Campaign.where(customer_id: current_user.customer_id, vendor_id: @id_array, end_date: "#{Time.now.year}0101".."#{Time.now.year}1231").count
---
SELECT COUNT(*) FROM `campaigns`  WHERE `campaigns`.`customer_id` = 3 AND `campaigns`.`vendor_id` IN (12) AND (`campaigns`.`end_date` BETWEEN '20190101' AND '20191231')


    respond_to do |format|
      #binding.pry
      if @campaign.update(campaign_params)
       logger.debug "-----------------UPDATE COMPLETE--------------------"
       if @current_user_role == 3
          @template = Campaign.find(@campaign.template_id)
          @template.questions.each do |q|
            dupe = q.dup
            kpid = q.kpi_id
            orig_kpi = Kpi.find(kpid)
            kpi_dupe = orig_kpi.dup
            kpi_dupe.original_kpi_id = kpid
            kpi_dupe.save
            dupe.kpi_id = kpi_dupe.id
            @campaign.questions << dupe
---
UPDATE `campaigns` SET `end_date` = '2019-12-31', `executive_sponsor` = '', `start_date` = '2019-12-01', `template_id` = 1, `tier` = 1, `updated_at` = '2019-12-27 07:04:04' WHERE `campaigns`.`id` = 37
SELECT `questions`.* FROM `questions` INNER JOIN `campaigns_questions` ON `questions`.`id` = `campaigns_questions`.`question_id` WHERE `campaigns_questions`.`campaign_id` = 28 AND `questions`.`id` IN (261, 262)
SELECT  `kpis`.* FROM `kpis`  WHERE `kpis`.`id` = 1 LIMIT 1
INSERT INTO `kpis` (`created_at`, `kpi`, `kpi_measurement`, `metric_id`, `original_kpi_id`, `updated_at`) VALUES ('2019-12-27 07:04:04', 'testing1', 'testing description 1', 1, 1, '2019-12-27 07:04:04')
INSERT INTO `questions` (`created_at`, `kpi_id`, `metric_id`, `opt1`, `opt2`, `opt3`, `opt4`, `opt5`, `opt6`, `opt7`, `rt_business_unit`, `rt_governance`, `rt_strategic_sourcing`, `rt_supplier`, `rt_supplier_diversity`, `srm`, `updated_at`, `weight`) VALUES ('2019-12-27 07:04:04', 246, 1, 'Failing', 'Attention Required', 'Lagging', 'Moderate', 'Excelling', 'Leader', 'Innovator', 1, 1, 1, 1, 1, 1, '2019-12-27 07:04:04', 0)

       end
       unless current_user
        incomplete = 0
        @reviewer = Reviewer.find(@campaign.responses.last.reviewer_id)
        if params[:commit] == "Submit"
              @reviewer.update(survey_complete: true)
              if @campaign.reviewers.where(survey_complete: false).blank?
---
SELECT  `responses`.* FROM `responses` INNER JOIN `questions` ON `responses`.`question_id` = `questions`.`id` INNER JOIN `campaigns_questions` ON `questions`.`id` = `campaigns_questions`.`question_id` WHERE `campaigns_questions`.`campaign_id` = 28  ORDER BY `responses`.`id` DESC LIMIT 1
SELECT `reviewers`.* FROM `reviewers` INNER JOIN `campaigns_reviewers` ON `reviewers`.`id` = `campaigns_reviewers`.`reviewer_id` WHERE `campaigns_reviewers`.`campaign_id` = 37
UPDATE `responses` SET `comment` = '', `updated_at` = '2020-01-13 18:56:55' WHERE `responses`.`id` = 28
UPDATE `reviewers` SET `survey_complete` = 1, `updated_at` = '2020-01-13 18:56:55' WHERE `reviewers`.`id` = 10
SELECT `reviewers`.* FROM `reviewers` INNER JOIN `campaigns_reviewers` ON `reviewers`.`id` = `campaigns_reviewers`.`reviewer_id` WHERE `campaigns_reviewers`.`campaign_id` = 28 AND `reviewers`.`survey_complete` = 0

  def results
    @underscore_name = current_user.name.gsub( /\W/, '-' )
    @graph_count = Graph.where(campaign_id: @campaign.id, user_id: current_user.id).count + 1
    metric_array = @campaign.metric_average
    answer_array = []
    metric_names = []
    year = Time.new.year
    chart_4_data = @campaign.get_performance_review_by_quarter_data(year)
    metric_array.each do |m|
---
SELECT COUNT(*) FROM `graphs`  WHERE `graphs`.`campaign_id` = 37 AND `graphs`.`user_id` = 15
SELECT `metrics`.* FROM `metrics`

      series_completed = Array.new
      specialists.each_with_index do |sp, index|
        logger.debug "sp[#{index}] ::: is ::: #{sp.inspect}"
        specialist_arr = specialist_arr.push(User.find(sp.specialist_id).name)
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 15  ORDER BY `users`.`id` ASC LIMIT 1

    def set_campaign
      @campaign = Campaign.find(params[:id])
---
SELECT  `campaigns`.* FROM `campaigns`  WHERE `campaigns`.`id` = 37 LIMIT 1

    def find_specialists
      @specialists = User.find_by_sql("
      SELECT users.id, users.first_name, users.last_name,
      user_roles.role_id, user_roles.user_id
---
SELECT `roles`.* FROM `roles` INNER JOIN `user_roles` ON `roles`.`id` = `user_roles`.`role_id` WHERE `user_roles`.`user_id` = 15