app/controllers/kpis_controller.rb

SELECT `metrics`.* FROM `metrics`
---
    def new
      @kpi = Kpi.new
      @metrics = Metric.all

SELECT `metrics`.* FROM `metrics`
---
    def edit
      @metrics = Metric.all

SELECT  `kpis`.* FROM `kpis`  WHERE `kpis`.`id` = 85 LIMIT 1
---
      def set_kpi
        @kpi = Kpi.find(params[:id])