app/controllers/static_controller.rb

SELECT `campaigns`.* FROM `campaigns`  WHERE `campaigns`.`template` = 1
SELECT `vendors`.* FROM `vendors`
SELECT `kpis`.* FROM `kpis`  WHERE `kpis`.`original_kpi_id` IS NULL
SELECT `users`.* FROM `users`  WHERE `users`.`inactive` = 0
---
  def admin_landing
    @campaigns = Campaign.where(template: true)
    @customers = Customer.where.not(id: 1)
    @vendors = Vendor.all
    @metrics = Metric.all
    @kpis = Kpi.where(original_kpi_id: nil)
    @users = User.where(inactive: false)

SELECT `campaigns`.* FROM `campaigns`  WHERE `campaigns`.`manager_id` = 1 AND `campaigns`.`template` = 0  ORDER BY `campaigns`.`created_at` DESC
SELECT  `vendors`.* FROM `vendors`   ORDER BY `vendors`.`id` ASC LIMIT 1
SELECT  `roles`.* FROM `roles` INNER JOIN `user_roles` ON `roles`.`id` = `user_roles`.`role_id` WHERE `user_roles`.`user_id` = 1  ORDER BY `roles`.`id` ASC LIMIT 1
SELECT  `customers`.* FROM `customers`  WHERE `customers`.`id` = 1 LIMIT 1
SELECT `campaigns`.* FROM `campaigns`  WHERE (customer_id = 3 and vendor_id = 12 and status != 'Complete' and specialist_id IS NOT NULL)
---
  def campaign_manager_landing
    @campaigns = Campaign.where(manager_id: current_user.id, template: false).order(created_at: :desc)
    @vendors = Vendor.all
    @metric_years = Array.new
    year = Vendor.first.created_at.year
    until year > Time.now.year
      @metric_years.push(year)
      year += 1
    end
    logger.debug "METRIC YEARS --------- #{@metric_years}"
    @specialists = User.find_by_sql("
      SELECT users.id, users.first_name, users.last_name,
      user_roles.role_id, user_roles.user_id
      FROM users, user_roles
      WHERE user_roles.role_id = 3
      AND users.id = user_roles.user_id
      ")
    @customer = Customer.find(current_user.customer_id) if !current_user.customer_id.blank?

SELECT `campaigns`.* FROM `campaigns`  WHERE `campaigns`.`customer_id` = 3 AND `campaigns`.`vendor_id` IN (12) AND (`campaigns`.`end_date` BETWEEN '20190101' AND '20191231')
SELECT `customers`.* FROM `customers` INNER JOIN `customers_vendors` ON `customers`.`id` = `customers_vendors`.`customer_id` WHERE `customers_vendors`.`vendor_id` = 1 AND `customers`.`id` = 1
---
    @vendor_array.each do |v|
      @id_array.push(v.id)
    end
    Campaign.where(customer_id: current_user.customer_id, vendor_id: @id_array, end_date: "#{Time.now.year}0101".."#{Time.now.year}1231").each do |c|

SELECT  `vendors`.* FROM `vendors`  WHERE `vendors`.`id` = 2 LIMIT 1
---
     unless any_vendors > 0
       @this_vendor << c.vendor_id
     end
     if Vendor.find(c.vendor_id).cw

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
---
      end
      unless any > 0
        if c.specialist_id.present?
          @this_specialist << User.find(c.specialist_id)

SELECT COUNT(*) FROM `campaigns`  WHERE `campaigns`.`customer_id` = 3 AND `campaigns`.`vendor_id` IN (12) AND (`campaigns`.`end_date` BETWEEN '20190101' AND '20191231')
---
      @cw_average = "N/A"
      @this_vendor_per_specialist = "N/A"
    end
    @this_year_campaigns = Campaign.where(customer_id: current_user.customer_id, vendor_id: @id_array, end_date: "#{Time.now.year}0101".."#{Time.now.year}1231").count

SELECT `users`.* FROM `users`  WHERE `users`.`customer_id` = 1
---
    end
    @last_year_campaigns = Campaign.where(customer_id: current_user.customer_id, vendor_id: @id_array, end_date: "#{Time.now.year - 1}0101".."#{Time.now.year - 1}1231").count
    @specialist_array = []
    User.where(customer_id: @customer.id).each do |u|

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 15  ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `customer_id` = 1, `updated_at` = '2019-12-25 02:57:12' WHERE `users`.`id` = 1
---
            series_completed = Array.new
            specialists.each_with_index do |sp, index|
              logger.debug "load_chart - sp[#{index}] ::: is ::: #{sp.inspect}"
              specialist_arr = specialist_arr.push(User.find(sp.specialist_id).first_name + " " + User.find(sp.specialist_id).last_name)

SELECT `campaigns`.* FROM `campaigns`  WHERE `campaigns`.`specialist_id` = 15 AND `campaigns`.`template` = 0 AND `campaigns`.`ready` = 1  ORDER BY `campaigns`.`created_at` DESC
SELECT `campaigns`.* FROM `campaigns`  WHERE `campaigns`.`specialist_id` = 15 AND `campaigns`.`template` = 0
---
  def specialist_landing
    @specialist_campaigns = Campaign.where(specialist_id: current_user.id, template: false, ready: true).order(created_at: :desc)
    @campaigns = Campaign.where(specialist_id: current_user.id, template: false)