app/controllers/user_invites_controller.rb

INSERT INTO `user_invites` (`created_at`, `email`, `first`, `last`, `updated_at`) VALUES ('2019-12-26 19:56:38', 'crazycrazydoctor@hotmail.com', 'Sameer', 'Sharma', '2019-12-26 19:56:38')
INSERT INTO `users` (`created_at`, `customer_id`, `email`, `encrypted_password`, `first_name`, `invitation_created_at`, `invitation_sent_at`, `invitation_token`, `last_name`, `senior_specialist`, `updated_at`) VALUES ('2019-12-26 19:56:39', 1, 'crazycrazydoctor@hotmail.com', '$2a$10$wGA8hZ/ffv/ZsTUcWmbQUedjsmD2bXFOqeAqrui1AmNlIEt1EruJa', 'Sameer', '2019-12-26 19:56:39', '2019-12-26 19:56:39', '5a9b79e9e77ff14f5a76180bf54776c0fe3ef68b87d8054f5ce88f6800005922', 'Sharma', 0, '2019-12-26 19:56:39')
SELECT  `users`.* FROM `users`  WHERE `users`.`email` = 'crazycrazydoctor@hotmail.com'  ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `user_roles` (`created_at`, `role_id`, `updated_at`, `user_id`) VALUES ('2019-12-26 19:56:39', 3, '2019-12-26 19:56:39', 2)
UPDATE `user_invites` SET `customer_id` = 1, `role_id` = 3, `updated_at` = '2019-12-26 19:56:38' WHERE `user_invites`.`id` = 1
---
  def create
    @user_invite = UserInvite.new(user_invite_params)
    if @user_invite.save
    _invitees = @user_invite
              user = User.new
              if user.admin(current_user.id)
                @user_invite.update(role_id: 2)
              elsif user.campaign_manager(current_user.id)
                @user_invite.update(role_id: 3, customer_id: current_user.customer_id)
              end
              email         = @user_invite.email
              first         = @user_invite.first
              last          = @user_invite.last
              role_id       = @user_invite.role_id
              # send email invitation if email address does not exist in the system;

              _user = User.find_by_email(email)
              if _user.nil?
                logger.debug "\n\n SENDING INVITATION MAIL  !!!  \n\n"
                user = User.invite!(:email => email, :first_name => first, :last_name => last, :customer_id => @user_invite.customer_id, :senior_specialist => false)
                user.save

SELECT  `customers`.* FROM `customers`  WHERE `customers`.`id` = 1 LIMIT 1
SELECT  `user_roles`.* FROM `user_roles`  WHERE `user_roles`.`user_id` = 1 LIMIT 1
---
                logger.debug "\n\n USER ALREADY EXISTS. INVITATION NOT SENT !!!  \n\n"
              end
       end
    @customer = Customer.find(current_user.customer_id) if !current_user.customer_id.blank?
    @specialists_for_this_customer = User.find_by_sql("
      SELECT users.id, users.first_name, users.last_name, users.email,  users.senior_specialist,
      user_roles.role_id, user_roles.user_id