app/controllers/users_controller.rb

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `senior_specialist` = 1, `updated_at` = '2019-12-26 19:56:45' WHERE `users`.`id` = 2
---
  def update
    @user = User.find(params[:id])
    respond_to do |format|
      if @user.update(account_update_params)

SELECT  `users`.* FROM `users`  WHERE `users`.`email` = 'crazycrazydoctor@hotmail.com' LIMIT 1
---
  def check_email
    @user = User.find_by_email(params[:user_invite][:email])