app/controllers/vendors_controller.rb

SELECT `vendors`.* FROM `vendors`   ORDER BY tier DESC, cw DESC
---
  def index
    @vendors = Vendor.all.order('tier DESC, cw DESC')

INSERT INTO `vendors` (`address`, `city`, `created_at`, `cw`, `name`, `revenue`, `size`, `state`, `updated_at`, `zipcode`) VALUES ('10171 Greg Grunberg Street', 'Greg Grunbergia', '2019-12-26 19:34:48', 4, 'Greg Grunberg', 1000000, 10, 'Gregston', '2019-12-26 19:34:48', 22222)
SELECT  `roles`.* FROM `roles` INNER JOIN `user_roles` ON `roles`.`id` = `user_roles`.`role_id` WHERE `user_roles`.`user_id` = 1  ORDER BY `roles`.`id` ASC LIMIT 1
SELECT `customers`.* FROM `customers` INNER JOIN `customers_vendors` ON `customers`.`id` = `customers_vendors`.`customer_id` WHERE `customers_vendors`.`vendor_id` = 2
SELECT `users`.* FROM `users`  WHERE `users`.`customer_id` = 1
SELECT  `customers`.* FROM `customers`  WHERE `customers`.`id` = 1 LIMIT 1
---
  def create
    @customer_id = current_user.customer_id
    @vendor = Vendor.new(vendor_params)
    if @vendor.save
     # Notify admins if a new vendor gets created
     if current_user.roles.first.id != 1
       SurveyMailer.vendor_email
     end
      @specialist_array = []
        User.where(customer_id: @customer_id).each do |u|
          logger.debug "---------------------USER ROLE: #{u.roles.first}----------------------------"
          if u.roles.first.id == 3
            @specialist_array.push(u)
          end
        end

      if current_user.roles.first.id == 2
        @vendor.customer_ids = @customer_id
        logger.debug "===========================#{@vendor.customer_ids}=========================="
      end
      @vendor_array = []
        Vendor.all.order('tier DESC, cw DESC').each do |v|
         if v.customers.where(id: @customer_id).present?