app/views/campaigns/_slides.html.erb

SELECT `graphs`.* FROM `graphs`  WHERE `graphs`.`campaign_id` = 37 AND `graphs`.`user_id` = 15
---
<% if Graph.where(campaign_id: @campaign.id, user_id: current_user.id).present? %>