app/views/campaigns/_vendor_select.html.erb

	  		<% if @campaign.vendor_id && @campaign.vendor_id != 0 %>
	  			<input id="vendor" value="<%=Vendor.find(@campaign.vendor_id).name%>">
---
SELECT  `vendors`.* FROM `vendors`  WHERE `vendors`.`id` = 5 LIMIT 1