app/views/campaigns/survey.html.erb


	  <% if Response.where(reviewer_id: @reviewer.id).blank? && !user_signed_in?%>
---
SELECT `responses`.* FROM `responses`  WHERE `responses`.`reviewer_id` = 10

				<td>
				<b><%=question_number += 1%>.</b> <%=Kpi.find(_kpi_id).kpi_measurement %>
---
SELECT  `kpis`.* FROM `kpis`  WHERE `kpis`.`id` = 244 LIMIT 1


		 <% if @campaign.questions.where(opt1: "").present? || @campaign.questions.where(opt2: "").present? || @campaign.questions.where(opt3: "").present? || @campaign.questions.where(opt4: "").present? || @campaign.questions.where(opt5: "").present? || @campaign.questions.where(opt6: "").present? || @campaign.questions.where(opt7: "").present? %>
---
SELECT `questions`.* FROM `questions` INNER JOIN `campaigns_questions` ON `questions`.`id` = `campaigns_questions`.`question_id` WHERE `campaigns_questions`.`campaign_id` = 28 AND `questions`.`opt7` = ''